{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi,SUST Chatbot",
        "Hlw",
        "Is anyone there?",
        "Hello",
        "I need help",
        "Admission help needed",
        "Hey",
        "hi",
        "hey",
        "hey there",
        "hello sust chatbot",
        "HI bot",
        "hiiiiiiii",
        "Hi, again",
        "I seek help",
        "Help needed",
        "Need some information",
        "Hello help needed",
        "Anyone here?",
        "Hellow",
        "hy"
      ],

      "responses": [
        
        "Hello. Welcome to SUST Chatbot. How can I help you ?"
      
      ]
    },
    
    {
      "tag": "payment",
      "patterns": [
        "Is my payment confirmed?",
        "payment",
        "bkash payement",
        "payment by rocket",
        "my payment",
        "Is my payment successful?",
        "Is payment done for me?",
        "Can you confirm my payment?"
      ],
      "responses": ["Nope"]
    },
    {
      "tag": "exam_date",
      "patterns": [
        "When is admission exam?",
        "exam kobe",
        "xm kobe ",
        "kokhon exam hobe",
        "Kundin exam hobe",
        "When will be admission test held?",
        "Exam kondin hobe",
        "SUST admission xm kobe",
        "when is sust admission xm",
        "xm kokhon",
        "When will be admission test?",
        "When is SUST admission test date?",
        "What is the SUST admission exam date?",
        "When will SUST admission test tale place?",
        "When is admission test?",
        "Which date will the admission test take place",
        "When is admission test?",
        "What is the SUST admission test date?",
        "Sust admission date",
        "What is the admission test date?",
        "When will admission exam take place?",
        "Tell me about exam date",
        "Tell us about SUST admission exam date",
        "Tell us about SUST admission test date",
        "Tell me about SUST admission exam date",
        "When is the admission exam of SUST?",
        "Which date will be admission exam?",
        "Sust admission test date",
        "sust admission exam date",
        "When SUST admission test take place?",
        "Admission test date",
        "When is the admission test of SUST?",
        "When will SUST admission test occur?"

      ],
      "responses": [
        "Hello! SUST admission test will be held on 23-05-2023. More details will be disclosed later. Exam will be taken in two groups. Group A from 9am to 12pm and Group B from 2pm to 4pm.",
        "Admssion test of SUST will take place on 23-05-2023. More details willl be informed soon.Exam will be taken in two groups. Group A from 9am to 12pm and Group B from 2pm to 4pm. Thanks for your query."
        
      ]
    },
    {
      "tag": "location",
      "patterns": [
        "where is sust located?",
        "where is sust?",
        "SUST is in where?",
        "Where is SUST located in Sylhet?",
        "Tell me the location of SUST",
        "How to go to SUST",
        "Where is SUST?",
      "Where is SUST situated?",
        "Which place is SUST in?",
        "SUST location","Location",
        "sust address",
        "sust kothay","Where is sust", "SUST koi",
        "sust in sylhet"

      ],
      "responses": [
      "SUST is located in Akhalia, Kumargaon, Sylhet , Bangladesh"]
    },
    
    
{"tag": "sust",
"patterns": ["Tell me something about sust","what is sust",
"Can you give me some details about SUST?",
"SUST?","SUST",
"Shahjalal University of Science and Technology","Do you know about sust",
"say something about sust","Can you expand on SUST?","I am looking for information about SUST","Need info of SUST","SUST information","Tell us about sust"],
"responses": ["Hello! Shahjalal University of Science and Technology (SUST) was established in 1986. The only university of its kind at that time, it started it''s journey on the 13th of February 1991 with only three departments: Physics, Chemistry and Economics, 13 teachers and 205 students. It has now expanded to 7 schools, 27 departments , 2 institutes and and centers. The number of teachers has grown to 566 and the students to 8596. Besides, the University has 12 affiliated colleges under the School of Medical Sciences with 4000 students."]
},
{
"tag": "academic_building",
"patterns": [
  "Academic buildings in sust","SUST academic buildings","Sust building","Number of academic buildings in sust",
  "How many academic buildings are there in sust","Buildings of study",
  "Building koyta","Academic Buliding of SUST"
],
"responses": ["The academic buildings are  IICT Building, Academic Building A, Academic Building B, Academic Building C, Academic Building D, Academic Building E"]
},

{
"tag": "bank",
"patterns": [
  "Where I can do payment","Is there any bank in sust","Where is Sonali bank of sust","Where should I pay my fee","Where am I going to pay my initial fee?",
"Direction of Sonali bank","Sonali Bank of SUST","Pay fee in sust","Where can I Pay money","Bank located in SUST","SUST Banks","Number of banks in SUST",
"Sonali bank of sust","SUST sonali bank"
],
"responses": ["There is a Sonali Bank branch in SUST. It is situated near the basket ball ground of SUST","Here SUST has a Sonali bank branch for payement related issues. You can find it after B building near the basktetball ground"]
},

{
"tag": "organization",
"patterns": [
"What societies are available at the university?",
"How many organizations are there in SUST","tell me about sust organizations",
"Which organizations I can participate","SUST organizations","Sust society and organizations","Tell me about different types of organizations of SUST"
],
"responses": ["There are various popular organizations in sust of various taste.Some popular organizations are -Shahjalal University Photographers Association (SUPA), -Shahjalal University Press Club, -Shahjalal University Debating Society (SUDS), -SUST CAREER CLUB (SUSTCC),-SUST School of debate, SUST-SD, -Tourist Club SUST, -Shikorh, -Chokh Film Society (CFS) , -NONGAR, -Sports SUST"]

},

    {"tag": "ability",
      "patterns": ["What can you do?", "What are your capabilities?","What kind of questions can you answer?","What are your services?", 
      "Tell me about your services.", "How can you help me?","services","sust chatbot services","What are your functions?","What is your purpose?"],
      "responses": ["I can provide any of the following services \n1.Enquiry about SUST \n2.Admission Date and Time \n3.Checking Exam centre\n4.Providing admission test result\n5.Payment Update\n6.Admission queries\n7.Information about various Departments\n8.Residential information\n9.Information about various campus organizations"]
    },
    {
        "tag": "sust_chatbot",
        "patterns": ["what is you?", "Tell me something about you", "Who are you?", "who you are?","what is sust chatbot?","Sust Chatbot"],
        "responses": [" SUST Chatbot is a smart user interface with updates and answers about SUST admission test related queries. Also it provides an overview of different queires related to SUST."]
    },
    {
        "tag": "exam_center",
        "patterns": ["where will be the exam today?","where is the exam center?","Tell me about the exam center","Exam center","I don't know anout my exam center",
        "Test center","exam-center","Examination center","I need to know the address of my exam center","Can you help me find the exam center for my subject?"],
        "responses": ["SUST IICT Building"]
    },
    {
        "tag": "result",
        "patterns": ["What was my result in the exam?",
        "Did I pass the exam?",
        "What was my score in the exam?",
        "Can you tell me my exam result?",
        "I want to know my exam result.",
        "Could you please let me know my exam result?",
        "I'd like to see my exam result.",
        "Can you show me my exam result?",
        "What was my performance in the exam?",
        "Can you give me my examresult summary?",
        "What is my result",
      
        "Is result published?"],
        "responses": ["Passed"]
    },
    {
      "tag": "resident",
      "patterns": [
        "What is the hall facility of SUST?",
        "How many halls are in here?",
"Sust er hall gula kemon",
"SUST hall availability",
"SUST halls",
"Seats in hall",
"SUST hall info",
       "SUST er hall obostha",
"Hall numbers"

      ],
      "responses": ["Currently,there are 5 halls of residence. A significant number of students reside privately near the university area of Sylhet metro. They are - Shah Paran Hall,Bangabandhu Sheikh Mujibur Rahman Hall,Syed Mujtaba Ali Hall,Shahid Jononi Jahanara Imam Hall,Begum Sirajunnesa Chowdhury Hall."]
    },
{
      "tag": "cost",
      "patterns": ["Cost of admission"," How much money is needed for admission",
"Koto taka lagbe admission hoite", "Amount of taka for admission", "Money for admission",
" Admission cost","Vortir taka","vortir tk ","koto tk lagbe vorti te?","First admission cost",
"SUST admission cost","How much money needed?"
],
      "responses": ["Applicant must bring the Admission Fee of BDT 15000 to complete the admission. But, the applicant who already completed his/her primary admission to any GST University have to bring only BDT 10000 for the admission."]
    },

    {
      "tag": "document",
      "patterns": [
        "What should I bring with me ?",
"What are needed for admission?",
"What is the requirements in admission",
"what i need to bring with me ?",
"which documents are needed in admission time?",
"Which informations are needed in admission"
      ],
      "responses": ["Hello. Students who did not submit their HSC & SSC original Marksheets at SUST, are requested to bring their original academic documents (either all Marksheets or Certificates). "]
    },
    {

      "tag": "Anthro",
"patterns": [
        "Tell me about Anthropology department",
"why should i get admitted into Anthropology dept",
"ANP dept",
"speciality of Anthropology dept",
"Anthropology dept",
"Anthropology is under which school",
"Facilities of Anthropology dept","Anthropology facilities",
"Overview of Anthropology",
"Anthropology is under which school"
],
"responses": ["The Department of Anthropology at SUST was established in 1995. The first course was offered in 1995 and the first 3 year Bachelor of Social Science and 1 year Master of Social Science Degrees was awarded in 1998 and 1999. Since 1995, more than one thousand students have received Bachelor of Social Science and Master of Social Science degrees. The department hosted a good number world renowned anthropologist over the years and initiated several research activities. SUST has now one of the oldest and most successful undergraduate and postgraduate Anthropology programs in Bangladesh and there is growing interest among students in taking up anthropology as the subject of study. Since its inception, the department has sought to achieve the highest possible distinction for teaching and scholarly research and has accomplished this by extending boundaries of knowledge in both traditional and new fields in the social sciences. We promote the highest academic standards in our teaching, our scholarship, and the connections we build between them. Synchronized with our institution’s rich heritage, the department is committed to produce the country’s leader in all facets, from classroom instruction to national policy setting. Our values-based commitment is to create an optimal learning environment for all students from all over the country and help expand the horizons of knowledge and culture among students, colleagues, and the general citizenry."] 
    },
    {
  
      "tag": "Mecha",
      "patterns": [
              "Tell me about archietecture department",
      "why should i get admitted into me dept",
      "me dept",
      "speciality of me dept",
      " Mechanical Engineering dept",
      "ME is under which school",
      "Facilities of ME dept","ME facilities",
      "Overview of ME",
      "ME is under which school"
      ],
      "responses": ["The vision of the Department of Mechanical Engineering is to be nationally and internationally recognized in providing mechanical engineering education, leading to well qualified engineers who are innovative, immediate contributors to their profession and successful in advanced studies. The Mechanical Engineering program makes available a high quality, relevant engineering education to all the students admitted in the Department. The Program dedicates itself to providing students with a set of skills, knowledge and attitudes that will permit its graduates to succeed and thrive as engineers and leaders. The Program strives to: Prepare its graduates to pursue life-long learning, serve the profession and meet intellectual, ethical and career challenges; Maintain a vital, state-of-the-art research enterprise to provide its students and faculty with opportunities to create, interpret, apply and disseminate knowledge; Prepare its graduates to become industrial and civic leaders and demonstrate entrepreneurial spirit. ME is situated in E building."
      ]
    },

    {

      "tag": "Stat",
"patterns": [
        "Tell me about archietecture department",
"why should i get admitted into stat dept",
"stat dept",
"speciality of statistics dept",
"statistics dept",
"Stat is under which school",
"Facilities of stat dept","Architecture facilities",
"Overview of stat",
"stat is under which school"

],
"responses": ["The Department of Statistics at SUST, which began its academic journey in 1991, is one of the pioneer departments of the university. It is one of the largest concentrations of statistical education and research with 23 faculties and 366 undergraduate and graduate students. Among the faculty members, there are 15 Professors, 4 Associate Professors and 4 Assistant Professors."
]
    },
    {
      "tag": "Economics",
"patterns": [
        "Tell me about Economics department",
"why should i get admitted into Economics dept",
"ECO dept",
"speciality of Economics dept",
"Economics dept",
"Economics is under which school",
"Facilities of Economics dept","Economics facilities",
"Overview of Economics",
"Economics is under which school"
],
"responses": ["Department of Economics is one of the pioneer departments of Shahjalal University of Science & Technology, Sylhet, Bangladesh. Proudly passing 25th academic year in 2015 this department now encompasses 16 faculty members, more than 300 students in the undergraduate level as well as 50 in the graduate level and a couple in post graduate degree program. Department of Economics, SUST has historically been led by energetic pungent young economists. Though this has caused a lot of troubles to the department in the way of achieving its academic goals and having excellence in its programs, it has also earned some rare feet within a very short period of time. First to incorporate integrated course system in Bangladesh, first to introduce semester system in any non-technical subject in Bangladesh, first to introduce laboratory based training in quantitative economics in Bangladesh – continuation and growth of this historic strength is evidenced by the Department’s performance in successful acceptance of its students in higher degree programs in Economics by renowned universities worldwide as well as their employment in different prestigious positions, involvement in research and various achievements. University Grants Commission (UGC), Bangladesh has granted many research proposals by the faculty members in recent years. Food and Agricultural Organization (FAO) financed the research project on Food Poverty and Consequent Vulnerability of Children"
]
    },
    {
      "tag": "fet",
      "patterns": [
        "Tell me about fet department",
"why should i get admitted into fet dept",
"fet dept",
"Forestry and Environmental Science",
"Fet is under which school",
"Facilities of FET dept","Fet facilities",
"Overview of FET",
"FET is under which school"
      ],
      "responses": ["Forestry and Environmental Science is under School of Agriculture and Mineral Sciences.A good number of experienced and devoted faculties and students coming from a broad range of backgrounds are in constant pursuit of seeking and creating knowledge in forestry. The department of FES presently offers 4-years BSc (Hons.) and two MSc degrees, MSc (General) and MSc (Thesis) in Forestry. On average, the department produces 50 graduates and 30 postgraduates each year.The department/school now provides ample opportunities to the students and faculties for education and research. The school is currently equipped with laboratory facilities in several relevant fields of research including plant genetics and biotechnology, remote sensing and Geographical Information System (GIS), forest ecology and management, and nursing of plants in a big nursery.Apart from regular academic activities, the department arranges technical seminars, thematic presentations, field visits, and national and international forest and environment-related days and events."]
    },

{
        "tag": "Architecture",
      
      "patterns": [
        "Tell me about archietecture department",
"why should i get admitted into arc dept",
"arc dept",
"speciality of architecture dept",
"Architecture dept",
"Arc is under which school",
"Facilities of ARC dept","Architecture facilities",
"Overview of ARC",
"ARC is under which school"
      ],
        "responses": ["Architecture (ARC) is one of the prestigious departments in Shahjalal University of Science and Technology (SUST) which was established in 2004 with an objective of keeping a pioneering role in the built environment of Bangladesh, especially in the north-eastern region. Department of Architecture offers a five years long bachelor's degree, where courses are designed in such a way so that students graduating from this department have a balance of theory and practical skills to prepare themselves for the highly competitive multidisciplinary workplace in the country and beyond. Academics and students are participating in activities of international architectural organizations like ARCASIA, CAA and others.Architecture dept is situated in A building"]
    },
    {"tag": "condition",
    "patterns": [
    "how are you",
    "how r u",
    "hw r u",
    "kemon acho?",
    "kmn acho",
    "kmn aco",
    "kamon aso",
    "kemon achen",
    "ki obostha?",
    "valo to?"
    ],
    "responses": ["I'm good. How about you?" ,"Going well, tell me 'bout you!.Everything is great.How are you?"
    ]
  }
    ,
    {
    "tag": "food and cafeteria",
    "patterns": [
    "Where can I get food",
    "Where food?",
    "cafeteria around here",
    "cafe",
    "tea stalls",
    "khabar koi pabo?",
    "khabar kothay paoa jay?",
    "khana",
    "where i get food",
    "i want to eat",
    "find me a place to eat",
    "tell me about food court",
    "khani koi paitam?",
    "khabar dorkar",
    "khete chai, kothay jabo?"
    ],
    "responses": [ "Certainly, you'll get food here. There is one Cafeteria at IICT Building and another one is Central Cafeteria which is located behind Academic Building C and beside Academic Building E. You'll also find food court and tea stalls around Gol Chattar. There are more Tongs in front of Academic Builading E. Enjoy!"
    ]
    
  },
  {
    "tag": "Singing_Organizations",
    "patterns": [
    "Is there any singing club?",
    "Gaan gaoar organization",
    "sing",
    "song",
    "musical organisation",
    "music school",
    "singers",
    "gaan gaoar kono platform ache?",
    "music clubs"
    ],
    "responses": 
    ["There are three musical organizations around here. RIM Musical Club Nongar Shikor Feel free to join."]},
{
        "tag": "CEP",
      
      "patterns": [
        "Tell me about cep department",
"why should i get admitted into cep dept",
"cep dept",
"speciality of cep dept",
"cep dept",
"CEP is under which school",
"Facilities of CEP dept","Chemical Technology and Polymer Science facilities",
"Overview of Chemical Technology and Polymer Science","Chemical engineering of sust",
"SUST cep",
"CEP is under which school"],
        "responses": ["The Department was founded in 1993 as the ‘Department of Chemical Technology and Polymer Science’ under the School of Applied Sciences and Technology.From the beginning educational programs at undergraduate and graduate level, and researches in the field of Chemical, process and environmental Engineering, and polymer technology have been developed in co-operation with national and international Institutions, and the quality and relevance of its activity is now recognized internationally, accredited by the ‘Board of Accreditation for Engineering and Technical Education (BAETE)’, Bangladesh in 2010.Currently, the academic staff comprises 25 members, 12 of them holding a PhD. Their activities are supported by 7 technical staff and research students. Researchers are engaged in R&D projects with internal and external funding. CEP department is in B building."]
    },
 {
      "tag": "CEE",
      "patterns": ["Tell me about cee department",
"why should i get admitted into cee dept",
"cee dept",
"speciality of cee dept",
"cee dept",
"CEE is under which school",
"Facilities of CEE dept","Civil and Environmental Engineering facilities",
"Overview of Civil and Environmental Engineering facilities","Civil and Environmental Engineering facilities of sust",
"SUST cep",
"Civil in sust",
"CEE is under which school"],
      "responses": ["The Department of Civil and Environmental Engineering (CEE) is one of the most prestigious departments of Shahjalal University of Science and Technology (SUST)."]
    },
    {
      "tag": "CSE",
      "patterns": ["Tell me about cse department",
"why should i get admitted into cse dept",
"cse dept",
"speciality of cse dept",
"cse dept",
"CSE is under which school",
"Facilities of CSE dept","Computer Science & Engineering",
"Overview of Computer Science & Engineering facilities","Computer Science & Engineering facilities of sust",
"SUST CSE",
"Wanna know about SUST CSE",
"CSE in sust",
"CSE is under which school"],
      "responses": ["Department of Computer Science & Engineering got down to its journey along with that of School of Applied Science in 1992, the time from which till today it heaves the strength with non-breaking waves. Besides four year undergraduate program this department is also successfully running some other activities like Post-graduate Diploma in Information Technology (one year program financed by the ministry of Science, Information & Communication Technology), Certificate in Computer Application (two term program jointly operated with computer center), CISCO Certified Network Program (four term one year program in collaboration with UNDP and CISCO), DCSA program operated jointly with Bangladesh Open University. Department has successfully run some research activities in collaboration with different universities of home & abroad. Some of them are Bangla Computerization, Natural Language Processing, Optical Character Recognition, Parallel Processing, Cluster Computer, CodeWitz, Asia Link Project, and Cellular Phone & Computer Interfacing etc. It has some sole student activities like Participation in ACM Regional and National Programming Competition, Arranging Computer Fair, Publication of Departmental Research Journal etc. Software House is departments another dazzling side whose aspire is to provide the students a professional working environment, which will sharpen their skill in software development. It was first started with 7 students and some young energetic teachers but now many students with highly motivated teachers are working incessantly to put it in pinnacle among all software development companies. CSE Dept is in IICT building."]
    },
    {
      "tag": "cse_research",
      "patterns": ["research field of cse","Sust cse research field","sust cse research works","cse researches","cse research","Cse ree history"],
      "responses": ["Some common research works of SUST CSE are- 1.Corpus Linguistics, 2.Neural Machine Translation,3.Statistical Machine Translation,4.Parts-of-speech Tagging"]
    },
    {
      "tag": "eee",
      "patterns": ["Tell me about eee department",
      "why should i get admitted into eee dept",
      "eee dept",
      "speciality of eee dept",
      "eee dept",
      "EEE is under which school",
      "Facilities of EEE dept",
      "Electrical & Electronic Engineering",
      "Overview of Electrical & Electronic Engineering facilities","Electrical & Electronic Engineering facilities of sust",
      "SUST EEE",
      "Wanna know about SUST EEE",
      "EEE in sust",
      "EEE is under which school"],
      "responses": ["The Department of Electrical & Electronic Engineering (EEE) has started it's journey in 24 January 2011 in the School of Applied Science & Technology of Shahjalal University of Science and Technology (SUST). Our outstanding faculty bring state-of-the-art research, development, and design experience into the classroom, ensuring that our students and alumni are amongst the best in their fields and that our research advances the scientific community as well as society and business. Currently department offers a four-year undergraduate program (B. Sc. Engineering) in Electrical and Electronic Engineering (EEE) and in very near future department is expecting to offer Masters Degree in Electrical and Electronic Engineering. Current B.Sc program provides comprehensive theoretical, practical and hands-on training through engineering design, project work and laboratory experiments. An industrial attachment program in third year enriches students’ experience in real-life engineering."]
    },
    {
      "tag": "ipe",
      "patterns": ["Tell me about sust ipe","why should i get admitted into ipe dept",
      "ipe dept",
      "speciality of ipe dept",
      "ipe dept",
      "IPE is under which school",

      "Industrial & Production Engineering",
      "Overview of Industrial & Production Engineering facilities","Industrial & Production Engineering facilities of sust",
      "SUST IPE",
      "Wanna know about SUST IPE",
      "IPE in sust",
      "IPE is under which school"],
      "responses": ["Established in 1995 as the first industrial engineering discipline (undergraduate level) in Bangladesh, the Department of Industrial and Production Engineering at SUST has made a name for itself in the engineering industry through excellence and innovation in research and education."]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "cya",
        "Biday","Onk onk dhonnobad","bye then","C u","by","ba baye","bye bye","Allah hafez","Will come again","Good bye",
        "See you later",
        "Goodbye",
        "I am Leaving",
        "Have a Good day",
        "bye",
        "cao",
        "see ya",
        "See u"
      ],
      "responses": ["Sad to see you go :(", "Talk to you later"]
    },
    {
      "tag": "extra",
      "patterns": [
        "welcome",
        "I'm good","ok","I'm fine"
      ],
      "responses": ["Let me know if you need any help."]
    }
  ]
}
